notes/DAT216x/index.org
#+STARTUP: inlineimages showall

#+TITLE: Delivering a Relational Data Warehouse
#+AUTHOR: Lei Zhao
#+DATE: <2018-06-04 Mon 00:23>
#+HTML_HEAD: <link type="text/css" href="../../styles/syntax-highlight.css" rel="stylesheet"/>
#+HTML_HEAD: <link type="text/css" href="../../styles/layout.css" rel="stylesheet"/>
#+HTML_HEAD: <script type="text/javascript" src="../../src/post.js"></script>
#+OPTIONS: ':t

[[https://www.edx.org/course/delivering-a-relational-data-warehouse][Delivering a Relational Data Warehouse]] on edX

* TODO Introducing the Data Warehouse

** TODO The Business Case for a Data Warehouse

Definition of Business Intelligence (BI)

According to Gartner, [[https://www.gartner.com/it-glossary/business-intelligence-bi/][BI]] is defined as follows.

#+BEGIN_QUOTE
A broad category of applications and technologies for gathering,
storing, analyzing, sharing and providing access to data to help
enterprise users make better business decisions.
#+END_QUOTE

[[https://www.edx.org/bio/peter-myers][Peter Myers]] simplifies it as follows.

#+BEGIN_QUOTE
It transforms data into knowledge to support decisions. 
#+END_QUOTE

BI is used by decision makers to:
 - Understand the health of the organization.
 - Collaborate on a shared view of:
   * Data,
   * Business logic, and
   * Business drivers.
 - Reduce the time to decision.

Its goal is often to:
 - Impact the bottom line by measuring specific operations.
 - Enhance competitive advantage.

#+BEGIN_QUOTE
BI is no longer a luxury afforded by a larger companies---it is
considered an essential part of the IT portfolio.
#+END_QUOTE

It encompasses a broad spectrum of technologies and requires skilled
professionals to design, develop and manage.

Common questions addressed by BI.
 * What sales have been made, and where?
 * How are the salespeople performing?
 * Which customers are likely to buy from us?
 * Which products do our customers buy together?
 * What is the customer sentiment of our new product?

Organizations have large volumes of related data stored in a variety
of data systems, often in different formats, and possibly residing in
different locations (on-premises, or cloud)

Data systems may not:
 - Be easily queried.
 - Be optimized for analytical queries.
 - Contain all the data required, by design, or in history.
 - Manage historical context.
 - Be available or accessible.

Employees may not have sufficient skills, tools, or permissions to
query data systems.
 - Commonly, employees do not have access to operational data systems,
   due to valid concerns that analytic queries can negatively impact
   on performance.

Systems may not have consistent definitions.

Decision makers need:
 - Data catalogs to discover and understand data assets.
 - Reliable, secure access to data.
 - Flexibility in the ways they access data
 - Low latency query results
 - Tools and training
   * View and interact with data assets and reports
   * Produce their own data models, reports, and dashboards (Self-Service BI)

Operational Reporting
 - Provides improved access to data from operational data systems.

Business Process or Activity Management
 - Provides improved analysis and reporting capabilities for specific
   business processes or activities.

Data Mart
 - Provides improved tools and access to business users of an
   application to enhance its value by improving decision making.
 - Delivers integrated reporting and analytics for a single subject area.

Enterprise Data Warehousing
 - Providing comprehensive integration of critical information across
   the enterprise
 - Breaks down the barriers between applications

Demo objectives:
 1. Describe common data challenges.
 2. Describe the purpose of the data warehouse.
 3. Describe the data warehouse ecosystem.

Delivering Business Intelligence
 1. Organizations accumulate data in many data sources and formats.
 2. Users may access data sources directly.
 3. Data sources can be mirrored/replicated to reduce contention.
 4. Operational data sources can be prepared for analytics.
 5. The data warehouse manages data for reporting and analytics.
    - Enterprise Data Warehouse consists of a series of data marts.
 6. Staging area may simply the loading of the data warehouse.
 7. Master data systems can manage consistent definitions.
 8. Data quality systems can help detect and cleanse dirty data.
 9. Only complete, credible, clean, consistent data is loaded.
 10. Data marts are designed with schemas optimized for analytics.
 11. The data warehouse comprises additional data assets (data models
     or cubes).

The data warehouse can enable governed Self-Service BI.

The data warehouse ecosystem consists of components and services to
deliver the data warehouse goals.
 - Extract, Transform, and Load systems
 - Operational Data Stores (ODS)
 - Staging systems
 - Master Data Management systems
 - Data Quality Management systems
 - Data models (OLAP)
 - Prediction models (data mining, or machine learning)
 - Data dictionaries

ETL
 * Extract, Transform, and Load (ETL) systems are concerned with
   moving and transforming data.
 * Transformations can include data integration, aggregation, change
   detection, calculations, conforming or cleansing.
 * ETL development is often complex and development can be challenging.
   - It is estimated that 60-80% of the data warehouse development
     effort is dedicated to the ETL process.

ODS
 * An ODS delivers a subject-oriented integrated store.
 * It serves two possible purposes:
   - Integration point for operational systems, providing real-time
     source for critical details (balances, etc.)
   - To supply current and detailed data for decision support
 * The ODS is updated frequently.
 * Contains all detail data required to describe low-level
   transactions.

Staging systems
 * Staging systems support data loading and transformation
   requirements
 * They are never intended to be accessed by end users
 * They can also provide ETL restartability, without the need to
   reload data from source systems

Master Data Management Systems
 * Master Data Management (MDM) systems deliver a master data hub that
   provides access to authoritative, standardized, and validated
   versions of data
 * They are concerned with the concept of the "Golden Record"
 * They are commonly used to define and maintain key business
   entities, for example, a master list of products

Data Quality Management Systems
 * Data Quality Management systems profile data to discover
   inconsistencies and other anomalies
 * They can also perform data cleansing activities to improve the data
   quality

Data Models
 * Data models deliver intuitive browsing and high performance query
   results---even over large volumes of data.
 * Data models are more commonly known as cubes.

Prediction Models
 * Prediction models are trained from data warehouse data, to detect
   patterns, clusters, relationships, and rules.
 * They deliver a model which can be used to explore data, or to
   perform predictions.

Current Trends
 * Based on recent technological advancements, today we are witnessing
   a paradigm shift in data warehousing.
   - Integration of big data analytics
   - Real-time insights
   - Complex data types
   - In-memory technologies
   - Seamless integration of data among cloud, on-premises, and hybrid
     environments

Gartner defines [[https://www.gartner.com/it-glossary/data-warehouse/][data warehouse]] as follows.

#+BEGIN_QUOTE
A *data warehouse* is a storage architecure designed to hold data
extracted from transaction systems, operational data stores and
external sources.  The warehouse then combines that data in an
aggregate, summary form suitable for enterprise-wide data analysis and
reporting for predefined business needs.

The five components of a data warehouse are:
 1. production data sources,
 2. data extraction and conversion,
 3. the data warehouse database management system
 4. data warehouse administration
 5. BI tools
#+END_QUOTE
